pip install pandas \
pip install --upgrade pandas

In [22]:
import pandas as pd
import numpy as np
print(pd.__version__)

2.2.0

- Pandas Series
- Pandas DataFrame --> use various ways to initialize it(dtype,columns,index)
- shape
- head
- tail
- columns
- to_csv (index = false)
- read_csv
-  drop(columns=[])
-  describe()
-  info()
-  iloc
-  loc
-  Access Particular Columns
-  indexing and slicing --> multirow and col
-  columns.get_loc
-  unique
-  sort_values(by,ascending)
-  convert to numpy array --> values

In [46]:
l = np.array([10,20,30,40])
d = {'A':10,'B':20,'C':30,'D':40}

In [51]:
# psa = pd.Series(l,dtype=np.int8)
# psa = pd.Series(l,index=['a','b','c','d'])
psa = pd.Series(d,index=['A','C','E'])

In [52]:
psa

A    10.0
C    30.0
E     NaN
dtype: float64

In [37]:
psa.iloc[0],psa.loc['b']

(10, 20)

In [38]:
psa.iloc[0] = 100

In [54]:
np.random.randint(1,100,5)

array([91,  8, 41, 59,  5])

In [68]:
d = {
    "MarksA" : np.random.randint(1,100,5),
    "MarksB" : np.random.randint(50,100,5),
    "MarksC" : np.random.randint(70,90,5)}

In [69]:
print(d)
print(type(d))

{'MarksA': array([82, 77, 28, 15, 24]), 'MarksB': array([83, 79, 63, 94, 52]), 'MarksC': array([88, 73, 74, 76, 72])}
<class 'dict'>

In [71]:
df = pd.DataFrame(d,index=['a','b','c','d','e'])
                  #,columns=["MarksA","MarksC","Phy"])
df

   MarksA  MarksB  MarksC
a      82      83      88
b      77      79      73
c      28      63      74
d      15      94      76
e      24      52      72

In [79]:
na = np.random.randint(1,100,(6,3))

In [81]:
df = pd.DataFrame(na,columns=["Phy","Chem","Maths"]
                 ,index = [10,20,30,40,50,60])
df

    Phy  Chem  Maths
10   24    67     63
20   82    48      9
30   36    77     80
40   44    12     11
50   46    84     71
60   37    31     51

In [83]:
df.head(n=3)

    Phy  Chem  Maths
10   24    67     63
20   82    48      9
30   36    77     80

In [85]:
df.tail(n=3)

    Phy  Chem  Maths
40   44    12     11
50   46    84     71
60   37    31     51

In [86]:
df.shape

(6, 3)

In [87]:
df.columns

Index(['Phy', 'Chem', 'Maths'], dtype='object')

In [92]:
df.to_csv("Marks.csv")

In [98]:
df = pd.read_csv("Marks.csv",names=["A","B","C","D"]
                 ,skiprows = 1)
df

   A   B   C   D
0  0  24  67  63
1  1  82  48   9
2  2  36  77  80
3  3  44  12  11
4  4  46  84  71
5  5  37  31  51

In [96]:
df = df.drop(columns=["Unnamed: 0"])
df

   Phy  Chem  Maths
0   24    67     63
1   82    48      9
2   36    77     80
3   44    12     11
4   46    84     71
5   37    31     51